OpenFOAM-11/tutorials/fluid/blockedChannel/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

volumeFraction
{
    type            volumeFractionSource;
    volumePhase     volume;
}

solidFraction
{
    type            volumeFractionSource;
    volumePhase     solid;
}

solidEquilibriumEnergy
{
    type            solidEquilibriumEnergySource;
    solidPhase      solid;
}

// ************************************************************************* //
